Repository: huahuahu/HHappyDocs
Catalog: MonoRepos/ExifViewer/SharedExifPackage/Sources/SharedExifPackage/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: An Error Occurred
zh_hans: 发生错误

source: Basic Info
zh_hans: 基本信息

source: Cancel
zh_hans: 取消

source: Close
zh_hans: 关闭

source: Date Time Digitized
zh_hans: 数字化日期和时间

source: Date Time Original
zh_hans: 原始日期和时间

source: Dimensions
zh_hans: 尺寸

source: Edit Metadata
zh_hans: 编辑元信息

source: Exif Editor
zh_hans: 编辑图片信息

source: Exif Viewer
zh_hans: 查看图片信息

source: Failed to create album
zh_hans: 创建相簿失败

source: Failed to load photo
zh_hans: 加载图片失败

source: Failed to remove metadata
zh_hans: 移除元数据失败

source: Failed to remove metadata with error code %1$lld.
zh_hans: 移除元数据失败，错误代码 %1$lld。

source: Failed to save without metadata
zh_hans: 无元数据保存失败

source: File Name
zh_hans: 文件名

source: Height
zh_hans: 宽度

source: Image saved successfully.
zh_hans: 图片保存成功。

source: Info
zh_hans: 详情

source: Location
zh_hans: 位置

source: Name of the photo
zh_hans: 图片文件名

source: No Photo Permission
zh_hans: 无照片访问权限

source: PicPeek Edits
zh_hans: 元图鉴

source: Please allow photo access in settings.
zh_hans: 请在设置中允许照片访问权限。

source: Save
zh_hans: 保存

source: Save Success
zh_hans: 保存成功

source: Save Without Metadata
zh_hans: 无元数据保存

source: Select photos
zh_hans: 选择图片

source: Settings
zh_hans: 设置

source: Share
zh_hans: 分享

source: Share with Metadata
zh_hans: 带元数据分享

source: Share without Metadata
zh_hans: 无元数据分享

source: Size
zh_hans: 大小

source: The date and time when the original image data was generated. For a digital still camera, the date and time the picture was taken are recorded.
zh_hans: 原始图像数据生成的日期和时间。对于数码静态相机，记录的是照片拍摄的日期和时间。

source: The dateTimeDigitized field in an image’s EXIF metadata refers to the date and time when the image was converted into a digital format. This timestamp is recorded when a physical photograph is scanned or a film photo is digitized, marking the moment the image transitioned from an analog to a digital representation. If the image was taken directly with a digital camera, this field may be identical to the original date and time of capture.
zh_hans: 数字化日期和时间字段在图片的 EXIF 元数据中指的是图像被转换为数字格式的日期和时间。这个时间戳记录了照片被扫描或胶片照片被数字化的时刻，标志着图像从模拟格式转变为数字格式。如果图像是直接用数码相机拍摄的，则该字段的时间可能与原始拍摄时间相同。

source: The dimensions of an image refer to the number of pixels along its horizontal (X-axis) and vertical (Y-axis) directions. The X dimension represents the image’s width, while the Y dimension represents its height. Together, these values determine the image’s resolution and clarity.
zh_hans: 图片的尺寸是指其在水平方向（X 轴）和垂直方向（Y 轴）上的像素数量，X 维度表示图片的宽度，Y 维度表示图片的高度，这两个数值共同决定了图片的分辨率和清晰度。

source: The height of an image refers to the number of pixels along its vertical (Y-axis) direction. It determines the image’s resolution and clarity.
zh_hans: 图片的高度是指其在垂直方向（Y 轴）上的像素数量。它决定了图片的分辨率和清晰度。

source: The location field in an image’s EXIF metadata refers to the location where the image was taken. This field is recorded when the image is captured with a device that has GPS capabilities, such as a smartphone or digital camera. The location data is stored as latitude and longitude coordinates, which can be used to pinpoint the exact spot where the photo was taken.
zh_hans: 图片的 EXIF 元数据中的位置字段记录了拍摄地点。当使用具有 GPS 功能的设备（如智能手机或数码相机）拍摄时，该字段会被记录。位置数据以经纬度坐标存储，可用于精确定位照片拍摄的具体位置。

source: The size of an image refers to the amount of space it takes up on your storage device. The size is measured in bytes, kilobytes (KB), megabytes (MB), gigabytes (GB), or terabytes (TB).
zh_hans: 图片的大小是指它在存储设备上占用的空间。大小的单位通常以字节（Bytes）、千字节（KB）、兆字节（MB）、千兆字节（GB）或太字节（TB）来表示。

source: The width of an image refers to the number of pixels along its horizontal (X-axis) direction. It determines the image’s resolution and clarity.
zh_hans: 图片的宽度是指其在水平方向（X 轴）上的像素数量。它决定了图片的分辨率和清晰度。

source: Width
zh_hans: 高度

# 畅享更多功能： • 编辑图像元信息 • 一键分享无元信息图像 • 更多高级功能敬请期待
source: Enjoy more features: • Edit image metadata • One-click share without metadata • More advanced features coming soon
zh_hans: 畅享更多功能： • 编辑图像元信息 • 一键分享无元信息图像 • 更多高级功能敬请期待

# 立即获取 Pro
source: Get Pro
zh_hans: 立即获取 Pro

# 解锁 Pro 版本
source: Unlock Pro Version
zh_hans: 解锁 Pro 版本
